$(document).ready(function () {
    //מכאן שינה משותפת
    var content_sleep = {
        "headline" : "שינה משותפת",
        "b1": "יש להשאיר את התינוק בחדר קרוב למיטה, אך על משטח נפרד המיועד לתינוקות, לפחות למשך ששת החודשים הראשונים ובאופן אידאלי במשך שנת חייו הראשונה של התינוק.",
        "b2": "ישנן ראיות לכך ששינה באותו החדר בחדר על משטח נפרד מקטינה את הסיכון של מוות בעריסה בכ-50%.",
        "b3":"ששת החודשים הראשונים בחיי התינוק הם קריטיים במיוחד, שיעורי המוות בעריסה גבוהים במיוחד במהלך חודשים אלו.",
        "b4": "הצבת העריסה במיקום קרוב למיטה, כך שהתינוק נמצא בטווח הראייה וההישג ידם, מקל על ההאכלה ומאפשר מעקב הדוק על התינוק.", 
        "b5":"אין מספיק ראיות להמליץ בעד או נגד השימוש במכשירים הטוענים שהם הופכים את חלוקת המיטה עם ההורה לבטוחה. אין שום הוכחה כי התקנים אלה מפחיתים את הסיכון של מוות בעריסה או חנק."
    };

    $("#sleep0").html(content_sleep.headline);
    $("#sleep1").html(content_sleep.b1);
    $("#sleep2").html(content_sleep.b2);
    $("#sleep3").html(content_sleep.b3);
    $("#sleep4").html(content_sleep.b4);
    $("#sleep5").html(content_sleep.b5);
    //עד כאן שינה משותפת

    // משטח שינה
    var content_playpen = {
        "headline": "משטח שינה",
        "b1": "השתמשו במשטח שינה קשה ושטוח (למשל, מזרון בעריסה שעומד בתקני הבטיחות) שמכוסה בסדין גומי ללא מצעים אחרים או פרטים רכים באזור השינה ",
        "b2": "אין להניח את התינוק לישון על משטחים רכים כגון כמו ספה, כרית ושמיכת פוך. ",
        "b3": "אם עוטפים את התינוק אך יש להשכיבו תמיד על הגב. כאשר התינוק מתחיל להראות סימנים של ניסיון להתגלגל, יש להפסיק את השימוש בעיטוף.",
        "b4": "מומלץ להשתמש במיטות תינוק חדשות ולא ישנות ולוודא שהמיטה עומדת בדרישות ובתקנות עדכניות. בנוסף, חשוב לוודא שלמיטה אין חלקים שבורים או חסרים. ",
        "b5": "התקני ישיבה, כגון מושבי בטיחות, עגלות, נדנדות, מנשאים, וטיולונים, אינן מומלצים לשינה שגרתית, במיוחד אצל תינוקות צעירים כיוון שגופם מתקפל בצורה שעלולה ליצור סיכון לחנק או לחסימת דרכי הנשימה.",
        "b6": "אין להשתמש במגני ראש ובמוצרים דומים אשר מתחברים לצידי מיטת התינוק או לסורגים. מגני הראש זוהו כגורם התורם למוות מחנק",
        "b7": "כיום לא קיימים נתונים אשר תומכים בשימוש במוניטור לב או נשימה כדי להקטין את הסיכון למוות בעריסה."
    };

    $("#playpen0").html(content_playpen.headline);
    $("#playpen1").html(content_playpen.b1);
    $("#playpen2").html(content_playpen.b2);
    $("#playpen3").html(content_playpen.b3);
    $("#playpen4").html(content_playpen.b4);
    $("#playpen5").html(content_playpen.b5);
    $("#playpen6").html(content_playpen.b6);
    $("#playpen7").html(content_playpen.b7);


    //עד כאן משטח שינה

    //הנקה
    var content_feeding = {
        "headline": "הנקה",
        "b1": "תינוקות שיונקים נמצאים בסיכון נמוך יותר מאשר תינוקות שלא הונקו מעולם. ",
        "b2": "בהתאם להמלצות תינוק צריך לינוק חלב אם בלבד למשך ששת החודשים הראשונים לחייו, אלא אם כן קיימת התוויה נגד הנקה בשל בעיות בריאות. ",
        "b3": "כל כמות של הנקה מקטינה את הסיכוי למוות בעריסה ועדיפה מאשר שום הנקה בכלל.",
    };

    $("#feeding0").html(content_feeding.headline);
    $("#feeding1").html(content_feeding.b1);
    $("#feeding2").html(content_feeding.b2);
    $("#feeding3").html(content_feeding.b3);

    //עד כאן הנקה

    //שכיבה על הגב
    var content_back = {
        "headline": "שכיבה על הגב",
        "b1": "על מנת להקטין את הסיכון למוות בעריסה, תינוקות צריכים להיות מושכבים לישון על הגב בלבד לכל סוגי השינה עד גיל שנה ",
        "b2": "שינה  על הצד נמצאה לא בטוח ולכן היא אינה מומלצת.",
        "b3": "תינוק אשר הורגל לישון על הגב ולאחר מכן מושכב על הבטן נמצא בסיכון גבוה יותר.",
        "b4": "תנוחת השינה על הגב אינה מגדילה את הסיכון לחנק בתינוקות. ",
        "b5": "אין צורך לתקן את תנוחת התינוק אם התינוק מתהפך לבדו בזמן השינה, מהגב לבטן ולהפך.",
        "b6": "קיימת המלצה לאפשר לתינוק לשכב על הבטן כשהוא ער ונמצא תחת השגחה",
        "b7": "יש להשכיב פגים לישון על הגב מוקדם ככל האפשר אחרי הלידה."
    };

    $("#back0").html(content_back.headline);
    $("#back1").html(content_back.b1);
    $("#back2").html(content_back.b2);
    $("#back3").html(content_back.b3);
    $("#back4").html(content_back.b4);
    $("#back5").html(content_back.b5);
    $("#back6").html(content_back.b6);
    $("#back7").html(content_back.b7);

    //עד כאן שכיבה על הגב

    //מוצץ
    var content_ppacifier = {
        "headline": "מוצץ",
        "b1": "יש להשתמש במוצץ בעת הנחת התינוק לשינה. אם התינוק מסרב למוצץ, אין להכריח אותו.",
        "b2": "בגלל הסיכון של חנק, המוצץ לא צריך להיות תלוי סביב הצוואר של התינוק. אין לחבר את המוצץ לחפץ כלשהו–כגון חוט, בגד, צעצוע רך או פריטים אחרים שעשויים להוות סיכון לחנק. ",
        "b3": "יש לחכות עד שהתינוק יונק היטב לפני שמציעים לו מוצץ.",
    };

    $("#pacifier0").html(content_ppacifier.headline);
    $("#pacifier1").html(content_ppacifier.b1);
    $("#pacifier2").html(content_ppacifier.b2);
    $("#pacifier3").html(content_ppacifier.b3);

    //עד כאן מוצץ

    //עישון
    var content_smoking = {
        "headline": "עישון",
        "b1": "עישון במהלך ההיריון ועשן בסביבת התינוק לאחר הלידה מגדילים את הסיכון פי שתיים למוות בעריסה ",
        "b2": "עישון פאסיבי מזיק לנשים בהריון ולתינוקות.",
        "b3": "הסיכון למוות בעריסה גבוה במיוחד כאשר התינוק חולק עם מבוגר מעשן מיטה, גם כאשר המבוגר אינו מעשן במיטה.",
        "b4": "כדי להקטין את הסיכון נשים צריכות לקבל טיפול טרום-לידתי מסודר במהלך ההיריון ולהימנע מעישון, שתיית אלכוהול, ושימוש במריחואנה או בסמים לא חוקיים במהלך ההיריון ולאחר לידת התינוק. ",
        "b5": "למרות החשש, אין כל עדות לכך שיש קשר סיבתי בין חיסונים למוות בעריסה. מחקרים הראו שחיסון התינוק עשוי אף להגן עלי."
   
 
    };

    $("#smoking0").html(content_smoking.headline);
    $("#smoking1").html(content_smoking.b1);
    $("#smoking2").html(content_smoking.b2);
    $("#smoking3").html(content_smoking.b3);
    $("#smoking4").html(content_smoking.b4);
    $("#smoking5").html(content_smoking.b5);

    //עד כאן עישון

    //חום גוף
    var content_heat = {
        "headline6": "חום גוף",
        "b1": "יש לוודא כי התינוק לא יתחמם יתר על המידה בזמן השינה.",
        "b2": "כדי למנוע התחממות יתר תינוקות צריכים להיות לבושים בהתאם לסביבה, לא יותר משכבה אחת מעל כמות השכבות שהמבוגר היה ללבוש כדי להרגיש בנוח בסביבה זו.",
        "b3": "יש להלביש את התינוק בבגדי שינה תקניים, כמו שקי שינה, שנועדו לשמור אותו חם ללא צורך בשמיכות חופשיות באזור השינה.",
        "b4": "הורים ומטפלים צריכים להישאר ערים ולחפש סימנים של התחממות יתר, כגון הזעה או שחזה התינוק מרגיש חם למגע. ",
        "b5": "יש להימנע מכיסוי של הפנים וראש התינוק.",
        "b6":"אין כיום ראיות מספיקות להמליץ על שימוש במאוורר כאסטרטגיית הפחתת הסיכון."


    };

    $("#heat0").html(content_heat.headline6);
    $("#heat1").html(content_heat.b1);
    $("#heat2").html(content_heat.b2);
    $("#heat3").html(content_heat.b3);
    $("#heat4").html(content_heat.b4);
    $("#heat5").html(content_heat.b5);
    $("#heat6").html(content_heat.b6);

    //עד כאן חום 

    //אקרדיון

    var content_Questions = {
        "headline6": "שאלות נפוצות",
        "b1": "האם ניתן למנוע מוות בעריסה?",
        "b2": "אין אפשרות למנוע מות עריסה כיוון שאיננו יודעים מה גורם לו, ולא ניתן לזהות תינוקות בסיכון. עם זאת, ניתן להפחית את גורמי הסיכון למות עריסה.",
        "b3": "מתי להשכיב תינוק על הגב?",
        "b4": "יש להרגיל את התינוק לשכב על הגב בזמן שינה כבר מרגע הגיעו הביתה מבית היולדות. הדגש הוא על שכיבה על הגב בזמן שינה. בערנות מומלץ להשכיבו על הבטן בהשגחת מבוגר. ",
        "b5": "האם שכיבה על הגב גורמת לחנק?",
        "b6": "אין עלייה בתחלואה מכל סוג שהוא אם מקפידים על ההוראות ומשכיבים את התינוק על הגב בזמן השינה בלבד.",
        "b7": "מה עושים כשתינוק כבר מתהפך?",
        "b8": "זוהי המלצת האגודה האמריקנית לרפואת ילדים: כשהתינוק כבר מתהפך מהגב לבטן עדיין יש להשכיבו לישון על הגב, אך לאפשר לו לישון בתנוחה שבה יבחר לעצמו בהמשך.",
        "b9": "האם להשתמש באביזרים למיקום התינוק?",
        "b10": "האגודה האמריקנית לרפואת ילדים אינה תומכת בשימוש באביזרים המיועדים לשמור את ראש התינוק במקום הרצוי.",
        "b11": "האם מומלצת לינה במיטה משותפת?",
        "b12": "ההמלצת הוועדה האירופית למניעת מוות פתאומי בתינוקות היא לישון באותו חדר, אך לא באותה מיטה, עקב הסיכון שמבוגר ילחץ על התינוק או ימעוך אותו בזמן השינה.",
        "b13": "האם מוות בעריסה קורה רק בלילה?",
        "b14": "רוב המקרים אכן מתרחשים בלילה, אך מות עריסה עלול לקרות בכל זמן (לדוגמה, עלול לקרות גם בעגלה באמצע היום).",
        "b15": "היכן ניתן לעבור קורס עזרה ראשונה לתינוק?",
        "b16": "מחלקת ההדרכה של מד''א מעבירה קורסי החייאה לתינוקות בכל רחבי הארץ, וניתן לפנות אליהם ישירות בטלפון:<br/>מחלקת הדרכה – 03-6390396<br/>מוקד לאומי – 1700-500-430<br/>פקס – 03-6870494"
};

    $("#Questions0").html(content_Questions.headline6);
    $("#Questions1").html(content_Questions.b1);
    $("#Questions2").html(content_Questions.b2);
    $("#Questions3").html(content_Questions.b3);
    $("#Questions4").html(content_Questions.b4);
    $("#Questions5").html(content_Questions.b5);
    $("#Questions6").html(content_Questions.b6);
    $("#Questions7").html(content_Questions.b7);
    $("#Questions8").html(content_Questions.b8);
    $("#Questions9").html(content_Questions.b9);
    $("#Questions10").html(content_Questions.b10);
    $("#Questions11").html(content_Questions.b11);
    $("#Questions12").html(content_Questions.b12);
    $("#Questions13").html(content_Questions.b13);
    $("#Questions14").html(content_Questions.b14);
    $("#Questions15").html(content_Questions.b15);
    $("#Questions16").html(content_Questions.b16);
//עד כאן  אקורדיון
 

    // אודות 
    var content_about = {
      
        "b0": "אודות",
        "b1": "אתר ייעודי להנחיות לשינה בטוחה ומניעת מוות פתאומי בתינוקות",
        "b2": "אפיון ופיתוח: שיר דייקן ולאה אמצסלבסקי",
        "b3": " אופיין ופותח במסגרת פרויקט בקורס תכנות 3 13217 תשע''ט",
        "b4": "מרצים: רעות בכר וד''ר דן כהן-וקס",
        "b5": "הפקולטה לטכנולוגיות למידה",
        "b6": "מכון טכנולוגי חולון"

    };

 
    $("#about0").html(content_about.b0);
    $("#about1").html(content_about.b1);
    $("#about2").html(content_about.b2);
    $("#about3").html(content_about.b3);
    $("#about4").html(content_about.b4);
    $("#about5").html(content_about.b5);
    $("#about6").html(content_about.b6);
    //עד כאן אודות 


//רכיב אקרדיון
function toggleIcon(e) {
    $(e.target)
        .prev('.panel-heading')
        .find(".more-less")
        .toggleClass('glyphicon-plus glyphicon-minus');
}
$('.panel-group').on('hidden.bs.collapse', toggleIcon);
$('.panel-group').on('shown.bs.collapse', toggleIcon);


});

